In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
df1 = pd.read_csv('../data/marketing_campaign_append1.csv')
df2 = pd.read_csv('../data/marketing_campaign_append2.csv')

In [3]:
df1.columns

Index(['ID', 'Year_Birth', 'Education', 'Marital_Status', 'Income', 'Kidhome',
       'Teenhome', 'Dt_Customer', 'Recency', 'MntWines', 'MntFruits',
       'MntMeatProducts', 'MntFishProducts', 'MntSweetProducts',
       'MntGoldProds', 'NumDealsPurchases', 'NumWebPurchases',
       'NumCatalogPurchases', 'NumStorePurchases', 'NumWebVisitsMonth',
       'AcceptedCmp3', 'AcceptedCmp4', 'AcceptedCmp5', 'AcceptedCmp1',
       'AcceptedCmp2', 'Complain', 'Z_CostContact', 'Z_Revenue', 'Response'],
      dtype='object')

In [4]:
df2.columns

Index(['ID', 'Year_Birth', 'Education', 'Marital_Status', 'Income', 'Kidhome',
       'Teenhome', 'Dt_Customer', 'Recency', 'MntWines', 'MntFruits',
       'MntMeatProducts', 'MntFishProducts', 'MntSweetProducts',
       'MntGoldProds', 'NumDealsPurchases', 'NumWebPurchases',
       'NumCatalogPurchases', 'NumStorePurchases', 'NumWebVisitsMonth',
       'AcceptedCmp3', 'AcceptedCmp4', 'AcceptedCmp5', 'AcceptedCmp1',
       'AcceptedCmp2', 'Complain', 'Z_CostContact', 'Z_Revenue', 'Response'],
      dtype='object')

In [6]:
marketing1 = df1[[
    'ID',
    'Year_Birth',
    'Education',
    'Marital_Status',
    'Income',
    'Kidhome',
    'Dt_Customer',
    'Recency',
    'NumStorePurchases',
    'NumWebVisitsMonth'
]]
marketing1.head()

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Dt_Customer,Recency,NumStorePurchases,NumWebVisitsMonth
0,5524,1957,Graduation,Single,58138.0,0,04/09/2012,58,4,7
1,2174,1954,Graduation,Single,46344.0,1,08/03/2014,38,2,5
2,4141,1965,Graduation,Together,71613.0,0,21/08/2013,26,10,4
3,6182,1984,Graduation,Together,26646.0,1,10/02/2014,26,4,6
4,5324,1981,PhD,Married,58293.0,1,19/01/2014,94,6,5

In [11]:
marketing2 = df2[[
    'ID',
    'Year_Birth',
    'Education',
    'Marital_Status',
    'Income',
    'Kidhome',
    'Dt_Customer',
    'Recency',
    'NumStorePurchases',
    'NumWebVisitsMonth'
]]
marketing2.head()

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Dt_Customer,Recency,NumStorePurchases,NumWebVisitsMonth
0,9135,1950,Graduation,Together,27203,1,06/08/2012,92,2,8
1,466,1944,Graduation,Married,65275,0,03/04/2013,9,13,2
2,9135,1950,Graduation,Together,27203,1,06/08/2012,92,2,8
3,10623,1961,Master,Together,48330,0,15/11/2013,2,3,5
4,8151,1990,Basic,Married,24279,0,29/12/2012,6,3,8

In [13]:
marketing1.shape, marketing2.shape

((500, 10), (500, 10))

In [14]:
appended_data = pd.concat([marketing1, marketing2])
appended_data.shape

(1000, 10)

In [18]:
marketing1['Income'].mean()

51400.735112936345

In [21]:
marketing2['Income'].mean()

53539.736

In [22]:
appended_data['Income'].mean()

52484.32218844985